# macOS packages — managed via chezmoi + Homebrew Bundle
# Run: brew bundle --global  (or the run_once bootstrap script handles this)

tap "homebrew/bundle"

# CLI essentials
brew "chezmoi"
brew "gh"
brew "git"
brew "git-lfs"
brew "direnv"
brew "starship"
brew "pyenv"
brew "node"
brew "uv"

# Shell utilities
brew "bat"
brew "eza"
brew "fd"
brew "ripgrep"
brew "fzf"
brew "zoxide"
brew "btop"

# Apps
cask "claude"
cask "cursor"
cask "devpod"
cask "orbstack"
cask "maccy"
cask "brave-browser"
cask "iina"
cask "telegram"
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"
