# macOS packages — applied only on Darwin via .chezmoiignore
# Run manually: brew bundle --global

tap "homebrew/bundle"

# -- Dev tools (universal counterparts installed via run_once on Linux) --
brew "chezmoi"
brew "git"
brew "git-lfs"
brew "gh"
brew "starship"
brew "direnv"
brew "pyenv"
brew "node"
brew "uv"

# -- Shell utilities --
brew "bat"       # better cat
brew "eza"       # better ls
brew "fd"        # better find
brew "ripgrep"   # better grep
brew "fzf"       # fuzzy finder
brew "zoxide"    # smarter cd
brew "btop"      # resource monitor

# -- Apps --
cask "claude"
cask "cursor"
cask "devpod"
cask "maccy"
cask "brave-browser"
cask "telegram"
cask "font-ubuntu-mono-nerd-font"
